package com.paypal.android.sdk;

import java.util.HashMap;
import java.util.Map;

public final class aL
  implements ap
{
  private static Map a = new HashMap();
  private static Map b = new HashMap();
  private static Map c = new HashMap();

  public aL()
  {
    a.put(bG.a, "Аутентификация");
    a.put(bG.b, "Назад");
    a.put(bG.c, "Отмена");
    a.put(bG.d, "Проверка устройства…");
    a.put(bG.e, "Очистить сведения о карте");
    a.put(bG.f, "Подтвердить");
    a.put(bG.g, "Вы уверены, что хотите очистить сведения о банковской карте?");
    a.put(bG.h, "Оплатить по карте");
    a.put(bG.i, "Выйти из учетной записи PayPal?");
    a.put(bG.j, "Отправить платеж");
    a.put(bG.k, "Принимаю");
    a.put(bG.l, "%s просит, чтобы вы:");
    a.put(bG.m, "<a href='%1$s'>Подтвердите списания</a> за будущие покупки через PayPal на %2$s. Вы разрешаете PayPal оплачивать все суммы, запрашиваемые %3$s.");
    a.put(bG.n, "Сообщить основные сведения о счете.");
    a.put(bG.o, "Подтвердить согласие с %1$s <a href='%2$s'>Политикой конфиденциальности</a> и <a href='%3$s'>Соглашением с пользователем</a>.");
    a.put(bG.p, "Согласиться");
    a.put(bG.q, "Эл. почта");
    a.put(bG.r, "Ложные данные");
    a.put(bG.s, "Изолированная программная среда");
    a.put(bG.t, "Действительна до");
    a.put(bG.u, "Забыли пароль?");
    a.put(bG.v, "С");
    a.put(bG.w, "Какой источник средств предпочтительнее для будущих платежей пользователю %1$s?");
    a.put(bG.x, "<h1><strong>Соглашение о будущих платежах</strong></h1><p>Для всех будущих платежей через PayPal этому продавцу будет использоваться ваш источник средств по умолчанию.</p><p>Для отмены данного соглашения войдите в систему PayPal под своим именем и перейдите по вкладке <strong>Профиль</strong> &gt; <strong>Мои настройки</strong> &gt; <strong>Войти через PayPal</strong> и удалите этого продавца из списка.</p><p>Будут выполнены условия раздела о регулярных платежах <a href='%s'>Соглашения с пользователем в отношении услуг PayPal</a>.</p><p>Для проверки работоспособности вашего счета PayPal это приложение может выполнить небольшую тестовую операцию без снятия или перевода денег.</p>");
    a.put(bG.y, "Внутренняя ошибка");
    a.put(bG.z, "<p>Нажимая кнопку ниже, я подтверждаю свое согласие с условиями <a href='%1$s'>Соглашения с пользователем в отношении услуг PayPal</a> и заявляю, что, совершая данную финансовую операцию, действую в соответствии с действующим законодательством Японии, включая санкции в отношении перевода платежей в Северную Корею и Иран в соответствии с <a href='%2$s'>Законом об обмене валют и зарубежной торговле</a>.</p>");
    a.put(bG.A, "Вход");
    a.put(bG.B, "Вход с помощью учетной записи PayPal");
    a.put(bG.C, "Выход");
    a.put(bG.D, "Выход");
    a.put(bG.E, "OK");
    a.put(bG.F, "Пароль");
    a.put(bG.G, "Способ оплаты");
    a.put(bG.H, "Оплатить картой");
    a.put(bG.I, "Телефон");
    a.put(bG.J, "PIN-код");
    a.put(bG.K, "PayPal гарантирует защиту ваших <a href='%s'>конфиденциальных данных</a> и финансовой информации.");
    a.put(bG.L, "Выполняется обработка");
    a.put(bG.M, "Запомнить карту");
    a.put(bG.N, "Была проблема связи с серверами PayPal. Повторите попытку.");
    a.put(bG.O, "Войдите в учетную запись PayPal заново.");
    a.put(bG.P, "Ваш сеанс истек");
    a.put(bG.Q, "Не выходить из системы");
    a.put(bG.R, "Системная ошибка (%s). Повторите попытку позже.");
    a.put(bG.S, "Повторить");
    a.put(bG.T, "Платежи через данное устройство запрещены.");
    a.put(bG.U, "Неавторизованное устройство");
    a.put(bG.V, "Платежи данному продавцу не разрешены (недействительный код клиента).");
    a.put(bG.W, "Недействительный продавец");
    a.put(bG.X, "Ваш заказ");
    a.put(bG.Y, "Очистить карту?");
    a.put(bG.Z, "Не удалось подтвердить согласие");
    a.put(bG.aa, "Соединение не выполнено");
    a.put(bG.ab, "Не удалось войти в систему");
    a.put(bG.ac, "Войдите в систему при помощи пароля");
    a.put(bG.ad, "Войдите в систему при помощи PIN-кода");
    a.put(bG.ae, "Минуточку…");
    a.put(bG.af, "Не удалось выполнить платеж");
    a.put(bG.ag, "Скан");
    a.put(bG.ah, "через");
    b.put("CONSENT_AGREEMENT_FUTURE_PAYMENTS|US", "Предварительно утвердить все будущие платежи с вашего <a href='%1$s'>счета PayPal</a>.");
    b.put("CONSENT_AGREEMENT_FUTURE_PAYMENTS|AU", "<p><a href='%1$s'>Подтвердите списания</a> за будущие покупки через PayPal на %2$s. Вы разрешаете PayPal оплачивать все суммы, запрашиваемые %3$s.</p><p>Для получения дополнительной информации смотрите <a href='https://www.paypal.com/webapps/mpp/ua/recurringpymts-full'>Соглашение PayPal о регулярных платежах и выставлении счетов</a>.</p>");
    b.put("CONSENT_AGREEMENT_FUTURE_PAYMENTS|CN", "<p><a href='%1$s'>Подтвердите списания</a> за будущие покупки через PayPal на %2$s. Вы разрешаете PayPal оплачивать все суммы, запрашиваемые %3$s.</p><p>Для получения дополнительной информации смотрите <a href='https://cms.paypal.com/c2/cgi-bin/?cmd=_render-content&content_ID=ua/UserAgreement_full'>Соглашение PayPal о регулярных платежах и выставлении счетов</a>.</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|US", "<h1><strong>Соглашение о будущих платежах</strong></h1><p>PayPal сначала будет использовать ваш остаток на счете PayPal для оплаты покупок. Если остаток на счете PayPal не покрывает общую сумму, то средства для оплаты заказа будут списываться с вашего банковского счета, с PayPal Credit, дебетовой или кредитной карты, и/или eCheck.</p><p>Чтобы аннулировать данное соглашение, перейдите на сайт www.paypal.com <strong>Профиль</strong> &gt; <strong>Мои настройки</strong> &gt; <strong>Войти через PayPal</strong> и удалите этого продавца из списка.</p><p>Для проверки платежеспособности вашего счета PayPal может понадобиться авторизация с помощью небольшого платежа. Авторизация будет аннулирована, и средства не будут списаны со счета.</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|AU", "<h1><strong>Соглашение о будущих платежах</strong></h1><p>Для проверки платежеспособности вашего счета PayPal это приложение может выполнить небольшую тестовую операцию без снятия или перевода денег.</p><p>Для оплаты покупок через PayPal будет использован способ оплаты по умолчанию (в таком порядке: остаток на вашем счете PayPal, привязанный банковский счет, привязанная банковская карта). Имейте в виду, что если способ оплаты по умолчанию окажется недостаточным для того, что оплатить покупку полностью, то банк или эмитент банковской карты может начислить вам комиссию.</p><p>Чтобы аннулировать это соглашение, войдите в систему PayPal под своим именем и перейдите к вкладке <strong>Профиль</strong>, затем нажмите <strong>Мои настройки</strong> и <strong>Изменить</strong> (рядом с кнопкой «Войти через PayPal»).</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|CN", "<h1><strong>Соглашение о будущих платежах</strong></h1><p>Для проверки платежеспособности вашего счета PayPal это приложение может выполнить небольшую тестовую операцию без снятия или перевода денег.</p><p>Для оплаты покупок через PayPal будет использован способ оплаты по умолчанию.</p><p>Чтобы аннулировать данное соглашение, войдите в систему PayPal под своим именем и перейдите по вкладке <strong>Профиль</strong> &gt; <strong>Настройки</strong> &gt; <strong>Войти через PayPal</strong> и удалите этого продавца из списка.</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|HK", "<h1><strong>Авторизация будущих платежей</strong></h1><p>Для проверки платежеспособности вашего счета PayPal это приложение может выполнить небольшую тестовую операцию без снятия или перевода денег.</p><p>Для оплаты покупок через PayPal будет использован способ оплаты по умолчанию.</p><p>Для отмены данной авторизации войдите в систему PayPal под своим именем и перейдите по вкладке <strong>Профиль</strong> &gt; <strong>Настройки учетной записи</strong> &gt; <strong>Войти через PayPal</strong> и удалите этого продавца из списка.</p><p>Для получения дополнительной информации смотрите раздел «Предварительно утвержденные платежи» <a href='%s'>Соглашения с пользователем в отношении услуг PayPal</a>.</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|SG", "<h1><strong>Авторизация будущих платежей</strong></h1><p>Для проверки платежеспособности вашего счета PayPal это приложение может выполнить небольшую тестовую операцию без снятия или перевода денег.</p><p>Для оплаты покупок через PayPal будет использован способ оплаты по умолчанию.</p><p>Для отмены данной авторизации войдите в систему PayPal под своим именем и перейдите по вкладке <strong>Профиль</strong> &gt; <strong>Настройки учетной записи</strong> &gt; <strong>Войти через PayPal</strong> и удалите этого продавца из списка.</p><p>Для получения дополнительной информации смотрите раздел «Предварительно утвержденные платежи» <a href='%s'>Соглашения с пользователем в отношении услуг PayPal</a>.</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|JP", "<h1><strong>Авторизация будущих платежей</strong></h1><p>Для проверки платежеспособности вашего счета PayPal это приложение может выполнить небольшую тестовую операцию без снятия или перевода денег.</p><p>Для оплаты покупок через PayPal будет использован способ оплаты по умолчанию.</p><p>Для отмены данной авторизации войдите в систему PayPal под своим именем и перейдите по вкладке <strong>Профиль</strong> &gt; <strong>Мои настройки</strong> &gt; <strong>Войти через PayPal</strong> и удалите этого продавца из списка.</p><p>Для получения дополнительной информации смотрите разделы «Авторизованные платежи» и «Предварительно утвержденные платежи» <a href='%s'>Соглашения с пользователем в отношении услуг PayPal</a>.</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|BR", "<h1><strong>Соглашение о будущих платежах</strong></h1><p>Для проверки платежеспособности вашего счета PayPal это приложение может выполнить небольшую тестовую операцию без снятия или перевода денег.</p><p>Для оплаты покупок через PayPal будут использоваться остаток на вашем счете PayPal или основная банковская карта.</p><p>Для отмены данного соглашения войдите в систему PayPal под своим именем и перейдите по вкладке <strong>Профиль</strong> &gt; <strong>Мои настройки</strong> &gt; <strong>Войти через PayPal</strong> и удалите этого продавца из списка.</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|MX", "<h1><strong>Соглашение о будущих платежах</strong></h1><p>Для проверки платежеспособности вашего счета PayPal это приложение может выполнить небольшую тестовую операцию без снятия или перевода денег.</p><p>Для оплаты покупок через PayPal будут использоваться остаток на вашем счете PayPal или основная банковская карта.</p><p>Для отмены данного соглашения войдите в систему PayPal под своим именем и перейдите по вкладке <strong>Профиль</strong> &gt; <strong>Мои настройки</strong> &gt; <strong>Войти через PayPal</strong> и удалите этого продавца из списка.</p>");
    c.put("INTERNAL_SERVICE_ERROR", "Системная ошибка. Повторите попытку позже.");
    c.put("EXPIRED_CREDIT_CARD", "Срок действия карты истек");
    c.put("EXPIRED_CREDIT_CARD_TOKEN", "Данные этой банковской карты были удалены из базы.\nОтправьте еще раз.");
    c.put("INVALID_ACCOUNT_NUMBER", "Такого номера счета не существует.");
    c.put("INVALID_RESOURCE_ID", "Системная ошибка. Повторите попытку позже.");
    c.put("DUPLICATE_REQUEST_ID", "Системная ошибка. Повторите попытку позже.");
    c.put("TRANSACTION_LIMIT_EXCEEDED", "Сумма превышает допустимый лимит.");
    c.put("REFUND_EXCEEDED_TRANSACTION_AMOUNT", "Требуемое возмещение превышает сумму исходной операции.");
    c.put("REFUND_TIME_LIMIT_EXCEEDED", "Истек срок возмещения по данной операции.");
    c.put("FULL_REFUND_NOT_ALLOWED_AFTER_PARTIAL_REFUND", "Средства по этой операции частично возвращены.");
    c.put("TRANSACTION_ALREADY_REFUNDED", "Возврат уже осуществлен.");
    c.put("CAPTURE_AMOUNT_LIMIT_EXCEEDED", "Сумма превышает допустимый лимит.");
    c.put("AUTHORIZATION_ALREADY_COMPLETED", "Авторизация уже выполнена.");
    c.put("CANNOT_REAUTH_CHILD_AUTHORIZATION", "Разрешено только повторное подтверждение первоначальной авторизации, а не повторная авторизация.");
    c.put("CANNOT_REAUTH_INSIDE_HONOR_PERIOD", "Повторное подтверждение не разрешается в течение срока акцептования.");
    c.put("TOO_MANY_REAUTHORIZATIONS", "Больше не допускается повторных подтверждений для данной авторизации.");
    c.put("PERMISSION_DENIED", "Требуется разрешение для запрашиваемой операции.");
    c.put("AUTHORIZATION_VOIDED", "Ваше разрешение аннулировано.");
    c.put("AUTHORIZATION_ID_DOES_NOT_EXIST", "Запрашиваемый код авторизации не существует.");
    c.put("VALIDATION_ERROR", "Реквизиты платежа недействительны. Исправьте и попробуйте еще раз.");
    c.put("CREDIT_CARD_REFUSED", "Карта отклонена");
    c.put("CREDIT_CARD_CVV_CHECK_FAILED", "Сведения о банковской карте недействительны. Исправьте и попробуйте еще раз.");
    c.put("PAYEE_ACCOUNT_RESTRICTED", "В настоящий момент получатель не может принять платеж.");
    c.put("PAYMENT_NOT_APPROVED_FOR_EXECUTION", "Плательщик не подтвердил платеж.");
    c.put("INVALID_PAYER_ID", "Системная ошибка (недействительный код плательщика). Повторите попытку позже.");
    c.put("PAYEE_ACCOUNT_LOCKED_OR_CLOSED", "В настоящий момент получатель не может принять платеж.");
    c.put("PAYMENT_APPROVAL_EXPIRED", "Истек срок подтверждения платежа.");
    c.put("PAYMENT_EXPIRED", "Истек срок платежа.");
    c.put("DATA_RETRIEVAL", "Системная ошибка. Повторите попытку позже.");
    c.put("PAYEE_ACCOUNT_NO_CONFIRMED_EMAIL", "Счет получателя не имеет подтвержденного электронного письма.");
    c.put("PAYMENT_STATE_INVALID", "Данный запрос недействителен вследствие текущего состояния платежа.");
    c.put("TRANSACTION_REFUSED", "В выполнении операции было отказано.");
    c.put("AMOUNT_MISMATCH", "Общая сумма товаров в корзине не соответствует сумме продаж.");
    c.put("CURRENCY_NOT_ALLOWED", "Данная валюта в настоящее время не поддерживается в системе PayPal.");
    c.put("CURRENCY_MISMATCH", "Валюта получения должна совпасть с валютой авторизации.");
    c.put("AUTHORIZATION_EXPIRED", "Срок авторизации истек.");
    c.put("INVALID_ARGUMENT", "Операции отклонена из-за неверной команды");
    c.put("PAYER_ID_MISSING_FOR_CARD_TOKEN", "Не удается получить доступ к сохраненным данным карты.");
    c.put("CARD_TOKEN_PAYER_MISMATCH", "Не удается получить доступ к сохраненным данным карты.");
    c.put("AUTHORIZATION_CANNOT_BE_VOIDED", "Невозможно аннулировать авторизацию на данном этапе.");
    c.put("REQUIRED_SCOPE_MISSING", "Системная ошибка. Повторите попытку позже.");
    c.put("UNAUTHORIZED_PAYMENT", "Продавец не принимает платежи такого типа.");
    c.put("DCC_UNSUPPORTED_CURRENCY_CC_TYPE", "Эта валюта не поддерживается для карты данного типа.");
    c.put("DCC_CC_TYPE_NOT_SUPPORTED", "Данный тип банковской карты не поддерживается.");
    c.put("INSUFFICIENT_FUNDS", "Покупатель не может произвести оплату: недостаточно средств.");
    c.put("TRANSACTION_REFUSED_PAYEE_PREFERENCE", "Настройки профиля продавца установлены на автоматическое отклонение определенных операций.");
    c.put("INVALID_FACILITATOR_CONFIGURATION", "Данная операция не может быть обработана вследствие недействительной конфигурации помощника.");
    c.put("AUTH_RC_RISK_FAILURE", "Отменено в связи с потенциальным риском.");
    c.put("AUTH_RC_OFAC_BLOCKED_IP", "Клиент не санкционирован.");
    c.put("AUTH_RC_IP_COMPLIANCE_FAILURE", "Клиент не санкционирован.");
    c.put("invalid_user", "Неправильное имя пользователя/пароль. Повторите попытку.");
    c.put("invalid_request", "Произошла ошибка.");
    c.put("unauthorized_client", "Запрос не санкционирован.");
    c.put("access_denied", "Запрос не санкционирован.");
    c.put("unsupported_response_type", "Произошла ошибка.");
    c.put("invalid_scope", "Запрос не санкционирован.");
    c.put("server_error", "Системная ошибка. Повторите попытку позже.");
    c.put("temporarily_unavailable", "Системная ошибка. Повторите попытку позже.");
  }

  public final String a()
  {
    return "ru";
  }

  public final String a(String paramString)
  {
    return (String)c.get(paramString);
  }
}

/* Location:           M:\Google Play\com.ubercab_dex2jar.jar
 * Qualified Name:     com.paypal.android.sdk.aL
 * JD-Core Version:    0.6.2
 */