package com.paypal.android.sdk;

import java.util.HashMap;
import java.util.Map;

public final class aq
  implements ap
{
  private static Map a = new HashMap();
  private static Map b = new HashMap();
  private static Map c = new HashMap();

  public aq()
  {
    a.put(bG.a, "جاري المصادقة");
    a.put(bG.b, "عودة");
    a.put(bG.c, "إلغاء");
    a.put(bG.d, "جاري فحص هذا الجهاز…");
    a.put(bG.e, "مسح معلومات البطاقة");
    a.put(bG.f, "تأكيد");
    a.put(bG.g, "هل أنت متأكد من أنك تود مسح معلومات بطاقتك؟");
    a.put(bG.h, "بطاقة الدفع الآجل");
    a.put(bG.i, "هل أنت متأكد من أنك تود تسجيل الخروج من باي بال؟");
    a.put(bG.j, "إرسال مدفوعات");
    a.put(bG.k, "موافقة");
    a.put(bG.l, "%s يطلب منك:");
    a.put(bG.m, "<a href='%1$s'>تفويض المدفوعات</a> لمشتريات ‎%2$s‎ المستقبلية المسددة قيمتها·بواسطة باي بال. أنت تُكلف باي بال بإجراء جميع المدفوعات التي يطلبها ‎%3$s‎‏.");
    a.put(bG.n, "مشاركة معلومات الحساب الأساسية.");
    a.put(bG.o, "الموافقة على <a href='%2$s'>سياسة الخصوصية</a> و<a href='%3$s'>اتفاقية المستخدم</a> %1$s‏.");
    a.put(bG.p, "قبول");
    a.put(bG.q, "البريد الإلكتروني");
    a.put(bG.r, "بيانات صورية");
    a.put(bG.s, "تقنية صندوق الرمل");
    a.put(bG.t, "تاريخ انتهاء الصلاحية");
    a.put(bG.u, "هل نسيت كلمة المرور؟");
    a.put(bG.v, "مِن");
    a.put(bG.w, "كيف ترغب في تمويل المدفوعات المستقبلية إلى %1$s‏؟");
    a.put(bG.x, "<h1><strong>اتفاقية المدفوعات المستقبلية</strong></h1><p>سيُستخدم مصدر الأرصدة الافتراضي لديك لسداد مدفوعات باي بال المستقبلية من هذا التاجر.</p><p>لإلغاء هذه الاتفاقية، سجِّل الدخول في حساب باي بال الخاص بك، واذهب إلى <strong>الملف الشخصي</strong> &gt; <strong>إعداداتي</strong> &gt; <strong>تسجيل دخول باي بال</strong> واحذف هذا التاجر من القائمة.تنطبق بنود </p><p>قسم المدفوعات المتكررة من <a href='%s'>اتفاقية مستخدم باي بال</a>.</p><p>للتأكد من إمكانية إجراء مدفوعات عبر حسابك على باي بال، قد يقوم هذا التطبيق بمحاكاة إجراء معاملة صغيرة على سبيل التجربة دون أن يتم تحويل أي مدفوعات.</p>");
    a.put(bG.y, "خطأ داخلي");
    a.put(bG.z, "<p>بالضغط على الزر أدناه، أقرُّ بموافقتي على بنود <a href='%1$s'>اتفاقية مستخدم باي بال</a> كما أُقرُّ بالتزامي بالقوانين والتشريعات اليابانية بما في ذلك العقوبات المفروضة على المدفوعات الموجهة إلى كوريا الشمالية وإيران وفقاً <a href='%2$s'>لقانون النقد الأجنبي والتجارة الخارجية</a> وذلك من أجل إتمام هذه المعاملة.</p>");
    a.put(bG.A, "تسجيل الدخول");
    a.put(bG.B, "تسجيل دخول باي بال");
    a.put(bG.C, "تسجيل الخروج");
    a.put(bG.D, "تسجيل الخروج");
    a.put(bG.E, "موافق");
    a.put(bG.F, "كلمة المرور");
    a.put(bG.G, "دفع بواسطة");
    a.put(bG.H, "دفع بواسطة البطاقة");
    a.put(bG.I, "الهاتف");
    a.put(bG.J, "رمز التعريف الشخصي");
    a.put(bG.K, "باي بال يحمي <a href='%s'>خصوصيتك</a> ومعلوماتك المالية.");
    a.put(bG.L, "جاري المعالجة");
    a.put(bG.M, "تذكّر البطاقة");
    a.put(bG.N, "لقد تعذر الاتصال بخوادم باي بال. يرجى إعادة المحاولة.");
    a.put(bG.O, "يرجى إعادة تسجيل الدخول في باي بال.");
    a.put(bG.P, "انتهى توقيت الجلسة.");
    a.put(bG.Q, "أبقني مسجَّل الدخول");
    a.put(bG.R, "خطأ نظام (%s‏). يرجى إعادة المحاولة لاحقاً.");
    a.put(bG.S, "أعد المحاولة");
    a.put(bG.T, "غير مسموح بإجراء مدفوعات من هذا الجهاز.");
    a.put(bG.U, "جهاز غير مفوض");
    a.put(bG.V, "غير مسموح بإجراء مدفوعات لهذا التاجر (هوية العميل غير صحيحة).");
    a.put(bG.W, "بيانات التاجر غير صحيحة");
    a.put(bG.X, "طلبك");
    a.put(bG.Y, "مسح البطاقة؟");
    a.put(bG.Z, "لم يفلح القبول");
    a.put(bG.aa, "لم يفلح الاتصال");
    a.put(bG.ab, "لم يفلح تسجيل الدخول");
    a.put(bG.ac, "تسجيل الدخول بكلمة المرور");
    a.put(bG.ad, "تسجيل الدخول برمز التعريف الشخصي");
    a.put(bG.ae, "لحظة من فضلك…");
    a.put(bG.af, "لم يفلح إجراء الدفع");
    a.put(bG.ag, "مسح ضوئي");
    a.put(bG.ah, "عَبْر");
    b.put("CONSENT_AGREEMENT_FUTURE_PAYMENTS|US", "موافقة مسبقة على جميع المدفوعات التي تُجريها من <a href='%1$s'>حساب باي بال</a> الخاص بك.");
    b.put("CONSENT_AGREEMENT_FUTURE_PAYMENTS|AU", "<p><a href='%1$s'>تفويض المدفوعات</a> لمشتريات ‎%2$s‎ المستقبلية المسددة قيمتها·بواسطة باي بال. أنت تُكلف باي بال بإجراء جميع المدفوعات التي يطلبها ‎%3$s‎‏.</p><p>يرجى الاطلاع على <a href='https://www.paypal.com/webapps/mpp/ua/recurringpymts-full'>اتفاقية باي بال للمدفوعات المتكررة والفوترة</a> لمعرفة مزيد من المعلومات.</p>");
    b.put("CONSENT_AGREEMENT_FUTURE_PAYMENTS|CN", "<p><a href='%1$s'>تفويض المدفوعات</a> لمشتريات ‎%2$s‎ المستقبلية المسددة قيمتها·بواسطة باي بال. أنت تُكلف باي بال بإجراء جميع المدفوعات التي يطلبها ‎%3$s‎‏.</p><p>يرجى الاطلاع على <a href='https://cms.paypal.com/c2/cgi-bin/?cmd=_render-content&content_ID=ua/UserAgreement_full'>اتفاقية باي بال للمدفوعات المتكررة والفوترة</a> لمعرفة مزيد من المعلومات.</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|US", "<h1><strong/>اتفاقية المدفوعات المستقبلية</strong></h1><p>سيبدأ باي بال باستخدام رصيدك المتاح على حساب باي بال لسداد قيمة المشتريات. إذا لم يغطي ذلك القيمة الإجمالية، سيُستخدم حسابك البنكي أو رصيد باي بال الائتماني أو بطاقة السحب أو بطاقة الائتمان و/أو شيكاً إلكترونياً، تبعاً لهذا الترتيب، للسداد.</p><p>لإلغاء هذه الاتفاقية، ادخل على www.paypal.com <strong>الملف الشخصي</strong> &gt; <strong>إعداداتي</strong> &gt; <strong>تسجيل دخول باي بال</strong> واحذف هذا التاجر من القائمة.</li><li>قد يلزم التفويض بدفع مبلغ صغير للتأكد من إمكانية تحميل مدفوعات على حساب باي بال الخاص بك مستقبلاً. سيتم إلغاء التفويض ولن يتم تحميلك أي مبالغ.</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|AU", "<h1><strong>اتفاقية المدفوعات المستقبلية</strong></h1><p>للتأكد من إمكانية تحميل مدفوعات على حساب باي بال الخاص بك في المستقبل، قد يقوم هذا التطبيق بمحاكاة إجراء معاملة صغيرة على سبيل التجربة دون أن يتم تحويل أي أموال.</p><p>ستُستخدم طريقة الدفع الافتراضية الخاصة بك (رصيدك على باي بال أو حسابك البنكي المربوط به أو بطاقة السحب أو بطاقة الائتمان، تبعاً لهذا الترتيب) لسداد قيمة المشتريات التي تتم عبر باي بال. يرجى العلم أنه في حالة عدم توفر أموال كافية لتغطية قيمة المشتريات في طريقة الدفع الافتراضية التي تستخدمها، فقد يفرض عليك البنك أو الجهة المقدمة للبطاقة رسوماً.</p><p>لإلغاء هذه الاتفاقية، سجِّل الدخول على حساب باي بال الخاص بك، واذهب إلى <strong>الملف الشخصي</strong>، ثم اضغط على <strong>إعداداتي</strong>، ثم <strong>تغيير</strong> بجوار ”تسجيل دخول باي بال“.</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|CN", "<h1><strong>اتفاقية المدفوعات المستقبلية</strong></h1><p>للتأكد من إمكانية تحميل مدفوعات على حساب باي بال الخاص بك في المستقبل، قد يقوم هذا التطبيق بمحاكاة إجراء معاملة صغيرة على سبيل التجربة دون أن يتم تحويل أي أموال.</p><p>سيتم استخدام طريقة الدفع الافتراضية لديك في سداد قيمة المشتريات التى تُجرى عبر باي بال.</p><p>لإلغاء هذه الاتفاقية، سجِّل الدخول في حسابك على باي بال، واذهب إلى <strong>الملف الشخصي</strong> &gt; <strong>الإعدادات</strong> &gt; <strong>تسجيل دخول باي بال</strong> واحذف هذا التاجر من القائمة.</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|HK", "<h1><strong>التفويض بالمدفوعات المستقبلية</strong></h1><p>للتأكد من إمكانية تحميل مدفوعات على حساب باي بال الخاص بك في المستقبل، قد يقوم هذا التطبيق بمحاكاة إجراء معاملة صغيرة على سبيل التجربة دون أن يتم تحويل أي أموال.</p><p>سيتم استخدام طريقة الدفع الافتراضية لديك في سداد قيمة المشتريات التى تُجرى عبر باي بال.</p><p>لإلغاء هذا التفويض، سجِّل الدخول في حساب باي بال الخاص بك، واذهب إلى <strong>الملف الشخصي</strong> &gt; <strong>إعدادات حسابي</strong> &gt; <strong>تسجيل دخول باي بال</strong> واحذف هذا التاجر من القائمة.</p><p>يرجى الاطلاع على قسم «المدفوعات الموافَق عليها مسبقاً» في <a href='%s'>اتفاقية مستخدم باي بال</a> للتعرف على مزيدٍ من المعلومات.</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|SG", "<h1><strong>التفويض بالمدفوعات المستقبلية</strong></h1><p>للتأكد من إمكانية تحميل مدفوعات على حساب باي بال الخاص بك في المستقبل، قد يقوم هذا التطبيق بمحاكاة إجراء معاملة صغيرة على سبيل التجربة دون أن يتم تحويل أي أموال.</p><p>سيتم استخدام طريقة الدفع الافتراضية لديك في سداد قيمة المشتريات التى تُجرى عبر باي بال.</p><p>لإلغاء هذا التفويض، سجِّل الدخول في حساب باي بال الخاص بك، واذهب إلى <strong>الملف الشخصي</strong> &gt; <strong>إعدادات حسابي</strong> &gt; <strong>تسجيل دخول باي بال</strong> واحذف هذا التاجر من القائمة.</p><p>يرجى الاطلاع على قسم «المدفوعات الموافَق عليها مسبقاً» في <a href='%s'>اتفاقية مستخدم باي بال</a> للتعرف على مزيدٍ من المعلومات.</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|JP", "<h1><strong>التفويض بالمدفوعات المستقبلية</strong></h1><p>للتأكد من إمكانية تحميل مدفوعات على حساب باي بال الخاص بك في المستقبل، قد يقوم هذا التطبيق بمحاكاة إجراء معاملة صغيرة على سبيل التجربة دون أن يتم تحويل أي أموال.</p><p>سيتم استخدام طريقة الدفع الافتراضية لديك في سداد قيمة المشتريات التى تُجرى عبر باي بال.</p><p>لإلغاء هذا التفويض، سجِّل الدخول في حسابك على باي بال، واذهب إلى <strong>الملف الشخصي</strong> &gt; <strong>إعداداتي</strong> &gt; <strong>تسجيل دخول باي بال</strong> واحذف هذا التاجر من القائمة.</p><p>يرجى الاطلاع على قسمي ”المدفوعات المفوض بها“ و”المدفوعات الموافَق عليها مسبقاً“ في <a href='%s'>اتفاقية مستخدم باي بال</a> لمعرفة من المعلومات.</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|BR", "<h1><strong>اتفاقية المدفوعات المستقبلية</strong></h1><p>للتأكد من إمكانية تحميل مدفوعات على حساب باي بال الخاص بك في المستقبل، قد يقوم هذا التطبيق بمحاكاة إجراء معاملة صغيرة على سبيل التجربة دون أن يتم تحويل أي أموال.</p><p>سيُستخدم رصيدك على باي بال أو بطاقة الائتمان أو بطاقة السحب الرئيسية لديك في سداد قيمة المشتريات التي تتم عبر باي بال.</p><p>لإلغاء هذه الاتفاقية، سجِّل الدخول في حسابك على باي بال، واذهب إلى <strong>الملف الشخصي</strong> &gt; <strong>إعداداتي</strong> &gt; <strong>تسجيل دخول باي بال</strong> واحذف هذا التاجر من القائمة.</p>");
    b.put("FUTURE_PAYMENT_LEGAL_DETAILS|MX", "<h1><strong>اتفاقية المدفوعات المستقبلية</strong></h1><p>للتأكد من إمكانية تحميل مدفوعات على حساب باي بال الخاص بك في المستقبل، قد يقوم هذا التطبيق بمحاكاة إجراء معاملة صغيرة على سبيل التجربة دون أن يتم تحويل أي أموال.</p><p>سيُستخدم رصيدك على باي بال أو بطاقة الائتمان أو بطاقة السحب الرئيسية لديك في سداد قيمة المشتريات التي تتم عبر باي بال.</p><p>لإلغاء هذه الاتفاقية، سجِّل الدخول في حسابك على باي بال، واذهب إلى <strong>الملف الشخصي</strong> &gt; <strong>إعداداتي</strong> &gt; <strong>تسجيل دخول باي بال</strong> واحذف هذا التاجر من القائمة.</p>");
    c.put("INTERNAL_SERVICE_ERROR", "خطأ نظام. يرجى إعادة المحاولة لاحقاً.");
    c.put("EXPIRED_CREDIT_CARD", "لقد انتهت صلاحية البطاقة");
    c.put("EXPIRED_CREDIT_CARD_TOKEN", "معلومات هذه البطاقة لم تعد موجودة بسجلاتنا.\nيرجى إعادة الإرسال.");
    c.put("INVALID_ACCOUNT_NUMBER", "رقم الحساب غير موجود.");
    c.put("INVALID_RESOURCE_ID", "خطأ نظام. يرجى إعادة المحاولة لاحقاً.");
    c.put("DUPLICATE_REQUEST_ID", "خطأ نظام. يرجى إعادة المحاولة لاحقاً.");
    c.put("TRANSACTION_LIMIT_EXCEEDED", "المبلغ يتجاوز الحد الأقصى المسموح به.");
    c.put("REFUND_EXCEEDED_TRANSACTION_AMOUNT", "المبلغ المطلوب رده يتجاوز قيمة المعاملة الأصلية.");
    c.put("REFUND_TIME_LIMIT_EXCEEDED", "لا يمكن رد قيمة هذه المعاملة نظراً لتقادمها.");
    c.put("FULL_REFUND_NOT_ALLOWED_AFTER_PARTIAL_REFUND", "تم بالفعل رد جزء من قيمة هذه المعاملة.");
    c.put("TRANSACTION_ALREADY_REFUNDED", "تم بالفعل رد قيمة هذه المعاملة.");
    c.put("CAPTURE_AMOUNT_LIMIT_EXCEEDED", "المبلغ يتجاوز الحد الأقصى المسموح به.");
    c.put("AUTHORIZATION_ALREADY_COMPLETED", "تم بالفعل استكمال هذا التفويض.");
    c.put("CANNOT_REAUTH_CHILD_AUTHORIZATION", "يمكنك فقط إجراء تجديد على التفويض الأصلي، وليس على إعادة التفويض.");
    c.put("CANNOT_REAUTH_INSIDE_HONOR_PERIOD", "لا يُسمح بإعادة التفويض خلال فترة التعهد.");
    c.put("TOO_MANY_REAUTHORIZATIONS", "لم يعد مسموحاً بإعادة تجديد هذا التفويض.");
    c.put("PERMISSION_DENIED", "لا يوجد تصريح بإجراء العملية المطلوبة.");
    c.put("AUTHORIZATION_VOIDED", "تم إلغاء التفويض.");
    c.put("AUTHORIZATION_ID_DOES_NOT_EXIST", "هوية التفويض المطلوبة غير موجودة.");
    c.put("VALIDATION_ERROR", "معلومات الدفع غير صحيحة. يرجى التصحيح وإعادة الإرسال.");
    c.put("CREDIT_CARD_REFUSED", "تم رفض البطاقة.");
    c.put("CREDIT_CARD_CVV_CHECK_FAILED", "معلومات البطاقة غير صحيحة. يرجى التصحيح وإعادة الإرسال.");
    c.put("PAYEE_ACCOUNT_RESTRICTED", "لا يمكن لهذا البائع تلقِّي مدفوعات في الوقت الحالي.");
    c.put("PAYMENT_NOT_APPROVED_FOR_EXECUTION", "لم يقم الدافع بالموافقة على الدفع.");
    c.put("INVALID_PAYER_ID", "خطأ نظام (هوية الدافع غير صحيحة). يرجى إعادة المحاولة لاحقاً.");
    c.put("PAYEE_ACCOUNT_LOCKED_OR_CLOSED", "لا يمكن لهذا البائع تلقي مدفوعات في الوقت الحالي.");
    c.put("PAYMENT_APPROVAL_EXPIRED", "انتهت صلاحية الموافقة على الدفع.");
    c.put("PAYMENT_EXPIRED", "انتهت صلاحية المدفوعات.");
    c.put("DATA_RETRIEVAL", "خطأ نظام. يرجى إعادة المحاولة لاحقاً.");
    c.put("PAYEE_ACCOUNT_NO_CONFIRMED_EMAIL", "لا يحتوي حساب المدفوع لأمره على عنوان بريد إلكتروني مؤكَّد.");
    c.put("PAYMENT_STATE_INVALID", "هذا الطلب غير صحيح نظراً للوضع الحالي للدفعة.");
    c.put("TRANSACTION_REFUSED", "تم رفض المعاملة.");
    c.put("AMOUNT_MISMATCH", "إجمالي قيمة الأغراض الموجودة بسلة التسوق لا يطابق مبلغ البيع.");
    c.put("CURRENCY_NOT_ALLOWED", "هذه العملة غير مدعومة حالياً من باي بال.");
    c.put("CURRENCY_MISMATCH", "يجب أن تكون عملة التحصيل هي نفس عملة التفويض.");
    c.put("AUTHORIZATION_EXPIRED", "انتهت صلاحية التفويض.");
    c.put("INVALID_ARGUMENT", "تم رفض المعاملة بسبب خطأ في أحد المعطيات.");
    c.put("PAYER_ID_MISSING_FOR_CARD_TOKEN", "يتعذر الوصول إلى معلومات البطاقة المحفوظة.");
    c.put("CARD_TOKEN_PAYER_MISMATCH", "يتعذر الوصول إلى معلومات البطاقة المحفوظة.");
    c.put("AUTHORIZATION_CANNOT_BE_VOIDED", "وضع التفويض لا يسمح بإلغائه.");
    c.put("REQUIRED_SCOPE_MISSING", "خطأ نظام. يرجى إعادة المحاولة لاحقاً.");
    c.put("UNAUTHORIZED_PAYMENT", "التاجر لا يقبل مدفوعات من هذا النوع.");
    c.put("DCC_UNSUPPORTED_CURRENCY_CC_TYPE", "العملة غير متاحة لنوع البطاقة هذا.");
    c.put("DCC_CC_TYPE_NOT_SUPPORTED", "نوع البطاقة غير مدعوم.");
    c.put("INSUFFICIENT_FUNDS", "المشتري لا يستطيع الدفع - لا تتاح مبالغ كافية.");
    c.put("TRANSACTION_REFUSED_PAYEE_PREFERENCE", "تفضيلات الملف الشخصي للتاجر معدَّة بحيث يتم رفض معاملات معينة تلقائيًا.");
    c.put("INVALID_FACILITATOR_CONFIGURATION", "تتعذر معالجة هذه المعاملة بسبب تهيئة خاطئة للوسيط.");
    c.put("AUTH_RC_RISK_FAILURE", "تم الرفض نظراً لوجود مخاطرة.");
    c.put("AUTH_RC_OFAC_BLOCKED_IP", "العميل غير مفوض.");
    c.put("AUTH_RC_IP_COMPLIANCE_FAILURE", "العميل غير مفوض.");
    c.put("invalid_user", "خطأ في اسم المستخدم / كلمة المرور. يرجى إعادة المحاولة.");
    c.put("invalid_request", "لقد حدث خطأ.");
    c.put("unauthorized_client", "طلب غير مفوض.");
    c.put("access_denied", "طلب غير مفوض.");
    c.put("unsupported_response_type", "لقد حدث خطأ.");
    c.put("invalid_scope", "طلب غير مفوض.");
    c.put("server_error", "خطأ نظام. يرجى إعادة المحاولة لاحقاً.");
    c.put("temporarily_unavailable", "خطأ نظام. يرجى إعادة المحاولة لاحقاً.");
  }

  public final String a()
  {
    return "ar";
  }

  public final String a(String paramString)
  {
    return (String)c.get(paramString);
  }
}

/* Location:           M:\Google Play\com.ubercab_dex2jar.jar
 * Qualified Name:     com.paypal.android.sdk.aq
 * JD-Core Version:    0.6.2
 */